{"topic":{"title":"M4: Content Question (Assembly Language Fundamentals )","time":null,"msg":"<p><span>Post questions about fundamentals of Assembly&nbsp;language.</span><span>&nbsp;Use the first line of your post as the subject of the post.</span></p>"},"replies":[{"id":"entry-2944950","entry":{"title":"dizzy cuckoo","time":"2021-07-07T02:31:40.000Z","msg":"<p>Hello all! Chapter 3 has sizable content and I am wondering how you will tackle that in such a short time. I am planning on driving by homework - as I work through the problem solving I will cover textbook material but definitely need some ideas on how to maximize the learning. Thanks in advance!</p>"},"replies":[{"id":"entry-2946227","entry":{"title":"secure salamander","time":"2021-07-07T09:01:51.000Z","msg":"<p>I'm going to try to do homework at the same time as I'm reading through, but with it being 35 pages, it's gonna be rough. Doing the quiz might be best to just get it out of the way too.&nbsp;</p>"},"replies":[]},{"id":"entry-2947361","entry":{"title":"statutory squirrel","time":"2021-07-07T22:43:49.000Z","msg":"<p>Hi there! What I do, is quickly read the reading and then&nbsp; watch a few extra YouTube videos (when I am not studying) and/or do some small sample problems.&nbsp;</p>"},"replies":[{"id":"entry-2947829","entry":{"title":"dizzy cuckoo","time":"2021-07-08T01:03:33.000Z","msg":"<p>Thanks, guys for chiming in! Yes, it is a bit rough but I am making progress!</p>"},"replies":[]}]},{"id":"entry-2954913","entry":{"title":"tough toad","time":"2021-07-10T01:17:58.000Z","msg":"<p>I break it up into short lessons so I can focus more and take notes. For example, I read 3.1-3.3 first while taking notes and then read the remaining chapter the next day. It helped me pay more attention to the textbook.</p>"},"replies":[]},{"id":"entry-2957398","entry":{"title":"puzzled pony","time":"2021-07-11T02:07:32.000Z","msg":"<p>I find that homework questions/programming questions usually cover different parts of the chapter.</p>\n<p>So I usually:</p>\n<p>Read through the question -&gt; then read through the part of the chapter that covers that material -&gt; then work on the question.&nbsp;</p>"},"replies":[{"id":"entry-2961190","entry":{"title":"relieved quail","time":"2021-07-12T06:05:10.000Z","msg":"<p>This is a good approach, I might do the same</p>"},"replies":[]}]},{"id":"entry-2957653","entry":{"title":"envious earwig","time":"2021-07-11T04:37:45.000Z","msg":"<p>I usually read the questions, then skim through the chapter and make sure I focus on what can help with the question. If the content is still confusing, I'd watch some Youtube videos. I skim so that I can effectively manage my time.</p>"},"replies":[{"id":"entry-2960428","entry":{"title":"faithful firefly","time":"2021-07-12T04:05:51.000Z","msg":"Same here"},"replies":[]}]},{"id":"entry-2959659","entry":{"title":"implicit hoverfly","time":"2021-07-12T01:16:09.000Z","msg":"<p>To understand the concept, I refer to books and teachers' lectures, and look up videos on YouTube for parts I don't understand well.</p>"},"replies":[{"id":"entry-2961577","entry":{"title":"abstract aardwolf","time":"2021-07-12T06:57:57.000Z","msg":"<p>I did the same.</p>"},"replies":[]}]},{"id":"entry-2961229","entry":{"title":"breezy bird","time":"2021-07-12T06:09:42.000Z","msg":"<p>For me, I would like to read through the textbook, take notes on what I don't understand, and make sure I come back to it for me to understand. After that work on the problems given.</p>"},"replies":[]},{"id":"entry-2961364","entry":{"title":"occasional muskox","time":"2021-07-12T06:27:44.000Z","msg":"Has anyone found any particularly useful YouTube playlists yet?"},"replies":[]},{"id":"entry-2961598","entry":{"title":"easy dolphin","time":"2021-07-12T06:59:46.000Z","msg":"<p>For me, I think skimming through the text first so that I have an idea of the material first, and then returning to specific concepts as needed while working through homework and problems would make me have a better grasp of the concepts in a reasonable amount of time.&nbsp;</p>"},"replies":[]},{"id":"entry-2961997","entry":{"title":"thin tick","time":"2021-07-12T16:53:39.000Z","msg":"<p>I do the same as the others who have replied here, in that I skim through the text, complete the assignments and then proceed to do the homework. I will review the text later just to have a complete understanding of it</p>"},"replies":[]}]},{"id":"entry-2949539","entry":{"title":"surviving takin","time":"2021-07-08T07:27:26.000Z","msg":"<p><span style=\"font-size: 18pt;\">64-bit vs. 2<sup>n</sup>-bit</span></p>\n<p>In terms of programming, 32-bit is slowly shifting to 64-bit and with the technology we currently have, so why wouldn't there be innovations for 128-bit, 256-bit, etc programming? Would that increase speed &amp; performance?</p>"},"replies":[{"id":"entry-2949910","entry":{"title":"loose llama","time":"2021-07-08T17:02:28.000Z","msg":"<p>Signed 64 bit numbers are HUGE and will probably be enough for quite some time.&nbsp; For example, Linux has been using a 32 bit Epoch time clock.&nbsp; This is the number of seconds since 1/1/1970.&nbsp; Unfortunately, this <a class=\"inline_disabled external\" href=\"https://en.wikipedia.org/wiki/Year_2038_problem\" target=\"_blank\" rel=\"noreferrer noopener\"><span>32 bit clock will overflow in 2038</span><span aria-hidden=\"true\" class=\"ui-icon ui-icon-extlink ui-icon-inline\" title=\"Links to an external site.\"></span><span class=\"screenreader-only\">&nbsp;(Links to an external site.)</span></a>.&nbsp; Of course, everything will switch over to 64 bit Epoch time to prevent catastrophic breakdown (though nuclear warhead launchers will likely still have old 32 bit clocks but nothing to worry about).&nbsp; So how long until the 64 bit timestamp wraps around and forces us to use 128 bit timestamps? &nbsp; Approximately 292 billion years from now.&nbsp; This is just one example of how large 64 bit values really are.</p>\n<p>Obviously strings and BLOBs can be trillions of bytes so being able to manipulate them quickly is always useful.&nbsp; But as far numeric integer values, 64 bits is more than enough for typical purposes.&nbsp; Scientific computing is another issue altogether and there are cases were extremely high precision floating point numbers are very useful.&nbsp; But for gaming, internet and accounting?&nbsp; 64 bit will be useful for a very long time.</p>"},"replies":[]},{"id":"entry-2960025","entry":{"title":"spatial snipe","time":"2021-07-12T03:01:25.000Z","msg":"<p>Unless clock speed increases, speed of the processor cannot be increased as per my understanding and readings.&nbsp; Any processor above 64 bit processor is not yet commercially available. As explained in other replies to your post, currently there is plenty of room till we catchup to the limitations of 64 bit processor, but in my opinion we may soon see 128 bit processor as well.&nbsp; I may think like multiple cores on a processor, CPU may perform multiple partitions of bits and create parallelism, which I am not entirely sure if that is possible.&nbsp;</p>"},"replies":[]},{"id":"entry-2960504","entry":{"title":"faithful firefly","time":"2021-07-12T04:18:49.000Z","msg":"There are totally innovations for such programming! Intel's AVX-512 works with 512-bit numbers on a 64 bit processor. Intel claims that this can help to increase throughput in such tasks as machine learning. Unfortunately, in many tasks that use floating point numbers increasing the precision beyond 64 bits is not particularly useful. Consider the fact that the some of the most precise physical measurements ever performed had an accuracy within a few parts in 10^13 (https://physics.stackexchange.com/questions/497087/what-is-the-most-precise-physical-measurement-ever-performed), while 2^512 is in the ballpark is of 10^514! Furthermore, with more bits comes with slowdowns in processing. Using AVX-512 comes with a 25 percent slowdown in clock speed. 64 bits is a good compromise for representing many physical quantities such as time, but not so processor intensive that it harms performance.<br><br>Also note that high bit counts mean that you are typically using high-precision floating point numbers, as there aren't many tasks that require calculating integers that large. Nowadays, intensive floating point operations are generally left to the GPU."},"replies":[]}]},{"id":"entry-2949956","entry":{"title":"consistent centipede","time":"2021-07-08T17:33:29.000Z","msg":"<p>In the slides, Chapter 3 Slide 53, it talks about how MASM supports 64-bit programming, with some restrictions. In which scenarios would we use 64-bit instead of 32-bit? Will we be using 32 or 64 bit in this class?</p>"},"replies":[{"id":"entry-2953901","entry":{"title":"loose llama","time":"2021-07-09T18:00:25.000Z","msg":"<p>This class is 32 bit only.</p>"},"replies":[{"id":"entry-2960731","entry":{"title":"professional pigeon","time":"2021-07-12T04:53:57.000Z","msg":"<p>yeah I second that</p>"},"replies":[]}]},{"id":"entry-2955063","entry":{"title":"Cole Gannon","time":"2021-07-10T02:22:29.000Z","msg":"<p>Nowadays, you probably only wanna be using 64 bit because that's what architecture most desktop processors use. When you write these 32 bit applications to run on windows 10 64 bit, windows actually emulates a 32 bit environment with it's cursed Windows on Windows (WoW6432) thing. For this class I guess we're just gonna use 32 bit because it's what the book says to do.</p>"},"replies":[]},{"id":"entry-2957324","entry":{"title":"close buzzard","time":"2021-07-11T01:15:14.000Z","msg":"<p>Hi Michael,</p>\n<p>The name of this class has \"x86\" which is 32 bit only.</p>\n<p>In the applications we use, making them 64 bit means the app can use more memory and not be restricted to 2-4 GB. There is still 32 bit for compatibility as 32 bit applications can run on a 64 bit processor / OS but not the other way around. 32 bit OSes are very rare nowadays though.</p>"},"replies":[]},{"id":"entry-2957428","entry":{"title":"agricultural ant","time":"2021-07-11T02:33:56.000Z","msg":"<p>It really depends on what processor you are running your code, there are 32-bit CPUs and 64 bit CPUs. 64 bit is useful when running more intensive workloads. You can run 32-bit code on 64 bit, but you cannot run 64bit code on 32 bit. In this class, we will be using 32bit.&nbsp;</p>"},"replies":[]},{"id":"entry-2959978","entry":{"title":"spatial snipe","time":"2021-07-12T02:55:19.000Z","msg":"<p>This is possible because only 32 bit can be used and the rest of the 32 bits can be ignored. The same will not be possible vice versa.&nbsp; x86 is old as per the slides, lectures and other resources, 32bit gives foundation of machine level which is not much different from 64 bit.&nbsp;</p>"},"replies":[]}]},{"id":"entry-2950310","entry":{"title":"genuine gopher","time":"2021-07-08T20:10:31.000Z","msg":"<p>Reserved words</p>\n<p>Why can't reserved words be used as identifies?</p>"},"replies":[{"id":"entry-2953447","entry":{"title":"surviving takin","time":"2021-07-09T07:59:56.000Z","msg":"<p>For example in C++, if you name an integer variable \"string\" the compiler wouldn't be able to properly differentiate the actual function of a string, used to define multiple characters, and it being a variable name, therefore string is a reserved word. The same applies to assembly programming.</p>"},"replies":[{"id":"entry-2955052","entry":{"title":"Cole Gannon","time":"2021-07-10T02:17:50.000Z","msg":"<p><code>string</code> is not a reserved word in C or C++. You can do <code>int string = 1</code> just fine. A good example of a reserved word in C++ would be <code>if</code>. As for the reason why reserved words exist in any language, that's just how the language works. The language uses those reserved words for it's own purposes. They're not user changable.</p>"},"replies":[]},{"id":"entry-2961313","entry":{"title":"driving deer","time":"2021-07-12T06:21:21.000Z","msg":"<p>Adding on to what Cole said, I think that the reserved words are simply a part of the language's syntax. I think that another good example in C++ specifically, is doing something like&nbsp;<code>int int = 0;</code>. It simply doesn't make sense to create an int variable named int since int is already necessary for specifying the variable type. If you then tried to print out the variable by doing something like <code>cout &lt;&lt; int;</code>, then it would not make any sense.&nbsp;</p>"},"replies":[]}]},{"id":"entry-2953714","entry":{"title":"impressive hummingbird","time":"2021-07-09T15:48:19.000Z","msg":"<p>Hi Haley, heres a list of most of the reserved words in MASM</p>\n<p>https://faculty.kfupm.edu.sa/coe/mudawar/coe205/manuals/MASMProgrGuide/D-ReservedWords.pdf</p>"},"replies":[]},{"id":"entry-2957948","entry":{"title":"grumpy haddock","time":"2021-07-11T06:20:35.000Z","msg":"<p>The reason reserved words can't be used as identifiers is that the compiler needs to be able to determine whether the code follows the syntax and rules of the language, and what code to generate. But if identifiers are used, the compiler may not be able to generate as you like. Additionally using reserved words are probably not descriptive enough to what the identifier is.</p>"},"replies":[]},{"id":"entry-2960733","entry":{"title":"professional pigeon","time":"2021-07-12T04:54:25.000Z","msg":"<p>Well, if you did so, the compiler would have trouble differentiating which is which.</p>"},"replies":[]},{"id":"entry-2961582","entry":{"title":"skilled silkworm","time":"2021-07-12T06:58:14.000Z","msg":"<p>Hi Haley,</p>\n<p>Thanks for the post. Reserved words cannot be used as identifiers because these words are used for particular functions and cannot be used for anything else because they are reserved by the language whereas an i<span>dentifier is a name used to identify a variable, function, class, module, or any other user-defined item.</span></p>\n<p><span>I hope this helps.&nbsp;</span></p>"},"replies":[]},{"id":"entry-2961610","entry":{"title":"entitled earwig","time":"2021-07-12T07:01:34.000Z","msg":"<p>You can't use reserved words as identifiers because the compiler would not be able to understand if you're using a reserved word or identifying something. Thus, you'll have errors in your code and it would have trouble compiling.</p>"},"replies":[]}]},{"id":"entry-2956493","entry":{"title":"passive owl","time":"2021-07-10T09:42:03.000Z","msg":"<p><span style=\"font-size: 18pt;\">The character 'h' behind the code.</span></p>\n<p>Example: str1 BYTE \"Enter name: \",0Dh,0Ah&nbsp;</p>\n<p>How can I understand the \"h\" that always behind the code \"0D\" &amp; \"0A\"?</p>"},"replies":[{"id":"entry-2956637","entry":{"title":"loose llama","time":"2021-07-10T17:22:48.000Z","msg":"<p>The \"h\" suffix indicates that the value is hexadecimal.&nbsp; For example in C/C++ you would use 0x1234 for hex, but in MASM you would use 1234h.&nbsp; If your hex values starts with an alpha character, then you need to prefix the value with a zero.&nbsp; So for example in C/C++ you could write 0xABCD, but MASM requires 0ABCDh.&nbsp; MASM would assume that ABCDh must be a constant, label or variable name.</p>"},"replies":[]}]},{"id":"entry-2956810","entry":{"title":"overseas orca","time":"2021-07-10T20:05:04.000Z","msg":"<p><strong>MOV Mnemonic</strong></p>\n<p>The book describes the MOV mnemonic, which moves a value from one register to another. For example, \"MOV eax, ebx\" would move the value in the ebx register to eax. Does this overwrite eax completely, or is the value that was previously in eax get stored somewhere in memory?</p>"},"replies":[{"id":"entry-2957039","entry":{"title":"supposed swordtail","time":"2021-07-10T22:35:21.000Z","msg":"<p>This will overwrite eax completely. Since we did not manually specify to move the value of eax to another location, the value will be lost.</p>"},"replies":[]},{"id":"entry-2957368","entry":{"title":"financial fowl","time":"2021-07-11T01:42:58.000Z","msg":"<p>So for any x86 register, there is a term called \"scratch\" that allows any function to overwrite another and can use it for anything, no questions asked. In this case, the value in the ebx register completely overwrites the eax register and there is no trace of the former value in eax.&nbsp;</p>"},"replies":[]}]},{"id":"entry-2957233","entry":{"title":"electoral dragon","time":"2021-07-11T00:30:07.000Z","msg":"<p>Integer Literals</p>\n<p>I had a question on the \"encoded real\"&nbsp; (r) radix. Is this the only way to store floats/numbers with a decimal point in assembly? And why is it classified as an integer literal if it is used to describe floats?</p>\n<p>Thanks!</p>"},"replies":[{"id":"entry-2960073","entry":{"title":"entitled earwig","time":"2021-07-12T03:11:48.000Z","msg":"<p>The radix refers to the base of the number, such as hexadecimal (base 16), binary (base 2), etc. For example, typing in h at the end of the number (as the radix), lets you type in hexadecimal numbers. The radix is not necessarily used to describe floats, but to specify the base of the integer literal. Floats are described using real number literals, not integer literals.&nbsp;</p>"},"replies":[]}]},{"id":"entry-2958413","entry":{"title":"enormous earthworm","time":"2021-07-11T15:14:50.000Z","msg":"<p>Comments<br><br>How did ; become the indicator for a single line comment in Assembly but in other languages it marks the end of the line of code you are working on?</p>"},"replies":[{"id":"entry-2958648","entry":{"title":"conscious cattle","time":"2021-07-11T18:59:15.000Z","msg":"I think when the assembly language was first used, the keyboard had a limited character set and that forced the developers to use ; for single line comment in Assembly language. But with time, more characters were added and it helped modern programming languages to use different syntax for comments.<div><br></div><div>The main reason ; is popular as a statement terminator is because most of today’s programming languages are based on ALGOL, and it used that convention.</div><div><br></div><div>This discussion was pretty helpful.</div><div><div><a href=\"https://softwareengineering.stackexchange.com/questions/139482/why-are-statements-in-many-programming-languages-terminated-by-semicolons\" class=\"external\" target=\"_blank\" rel=\"noreferrer noopener\"><span>https://softwareengineering.stackexchange.com/questions/139482/why-are-statements-in-many-programming-languages-terminated-by-semicolons</span><span aria-hidden=\"true\" class=\"ui-icon ui-icon-extlink ui-icon-inline\" title=\"Links to an external site.\"></span><span class=\"screenreader-only\">&nbsp;(Links to an external site.)</span></a><br></div></div>"},"replies":[]}]},{"id":"entry-2959163","entry":{"title":"relaxed python","time":"2021-07-11T22:43:37.000Z","msg":"<p><strong>FWORD</strong></p>\n<p>I realized that FWORD is for the usage of 48-bit integer, but I'm wondering how do we initialize it in the code?</p>\n<p>&nbsp;</p>"},"replies":[]},{"id":"entry-2959713","entry":{"title":"loose llama","time":"2021-07-12T01:35:26.000Z","msg":"<p>What about signed and unsigned QWORD?</p>\n<p>Chapter 3 mentions the following values with signed and unsigned variations:</p>\n<ul>\n<li>BYTE, SBYTE - 8 bit unsigned and signed integer values</li>\n<li>WORD, SWORD - 16 bit unsigned and signed integer values</li>\n<li>DWORD, SDWORD - 32 bit unsigned and signed integer values</li>\n</ul>\n<p>But only one type for 64 values:</p>\n<ul>\n<li>QWORD - 64 bit integer value</li>\n</ul>\n<p>Why is there no signed variant for 64 bit values?</p>\n<p>&nbsp;</p>"},"replies":[{"id":"entry-2962227","entry":{"title":"insufficient junglefowl","time":"2021-07-12T19:34:37.000Z","msg":"<p><span>Only the move to and from accumulator has a 64 bit absolute address variant.</span><br><span>All other moves are&nbsp;</span><em>limited</em><span>&nbsp;to the 32 bit displacement methods.</span></p>"},"replies":[]}]},{"id":"entry-2959941","entry":{"title":"advanced anaconda","time":"2021-07-12T02:47:16.000Z","msg":"<p>In the book chapter 3 page 62, it tries to explain how NOP is used to align the address of the third instruction to a doubleword boundary.</p>\n<p>I am not clear how the address alignment is calculated. Hope someone can explain it.</p>\n<p><img src=\"https://deanza.instructure.com/users/131648/files/5552371/preview?verifier=w5PfNybLGDrMi0dLWs2ZKFPSg2NfeZFhwqmc3g3m\" alt=\"Screenshot 2021-07-11 194259.jpg\" data-api-endpoint=\"https://deanza.instructure.com/api/v1/users/131648/files/5552371\" data-api-returntype=\"File\" style=\"max-width: 687px;\" width=\"687\" height=\"246\">&nbsp;</p>"},"replies":[{"id":"entry-2960327","entry":{"title":"brief bird","time":"2021-07-12T03:51:37.000Z","msg":"<p>Hi Sarah, I'm pretty confused about this too. This might help clear up a little bit, but it doesn't personally answer all of my questions.</p>\n<p>https://stackoverflow.com/questions/4909563/why-should-code-be-aligned-to-even-address-boundaries-on-x86</p>"},"replies":[]},{"id":"entry-2960628","entry":{"title":"conscious cattle","time":"2021-07-12T04:36:28.000Z","msg":"<p>Ok so the first instruction deals with a word size of 3 bytes referring to '66 8B C3' so it takes up 3 bytes of space starting from byte address 00000000.</p>\n<p>Now the second instruction nop is starting from byte address 00000003 and inputs the byte '90' to take up the 1 byte of space. It acts essentially as a buffer and then leaves us at byte address 00000004.</p>\n<p>This essentially aligns the address so that the processor will be able to access memory more quickly since the next instruction will begin at an address that is a multiple of 4.</p>\n<p>Hope that explains it.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"},"replies":[]}]},{"id":"entry-2960272","entry":{"title":"geographical gopher","time":"2021-07-12T03:41:42.000Z","msg":"<p>Reading about the format using : notation, does this mean batch files run at a lower level? That is the lowest or earliest language I recall that uses colons.&nbsp;</p>\n<p>In ASM programs to comments get removed on compile?</p>\n<p>Is the AddTwo.asm in the presentation good enough for the HW?</p>\n<p>When we're outputting using the debugger, what level is this code running at and returning? Is this the OS providing APIs or have we gone lower?</p>\n<p>\"<span class=\"textLayer--absolute\">MASM does not prevent you from initializing a BYTE with a negative </span><span class=\"textLayer--absolute\">value, but it's considered poor style.\" why is this poor style? I've never heard of defining negative variables as a bad thing.</span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"},"replies":[]},{"id":"entry-2960729","entry":{"title":"professional pigeon","time":"2021-07-12T04:53:38.000Z","msg":"<p>Do we get to set our own values on A, B, C, D for Q1?</p>"},"replies":[{"id":"entry-2962765","entry":{"title":"easy dolphin","time":"2021-07-12T23:58:41.000Z","msg":"<p>I'm assuming we should as the question tells us to \"assign integer values to the EAX... registers\". I did the same.</p>"},"replies":[]},{"id":"entry-2963432","entry":{"title":"civic bovid","time":"2021-07-13T04:21:46.000Z","msg":"<p>Yes, we should set up values for them.</p>"},"replies":[]}]},{"id":"entry-2960735","entry":{"title":"moaning mastodon","time":"2021-07-12T04:54:42.000Z","msg":"<p>Are there any alternative methods of learning this content? I have read the chapter and am still confused and also have not found any good YouTube videos on it.</p>"},"replies":[{"id":"entry-2960924","entry":{"title":"driving deer","time":"2021-07-12T05:27:47.000Z","msg":"<p>Hi Aman,</p>\n<p>Did you go through the the powerpoint for this module in the instructional content page on Canvas? I thought that it was pretty helpful in addition to the textbook because it does not have as much reading and simplifies the information nicely. There was also one slide that had a nice template. I have not gone through the video lectures, so I unfortunately cannot comment on that.</p>"},"replies":[]},{"id":"entry-2961614","entry":{"title":"easy dolphin","time":"2021-07-12T07:03:07.000Z","msg":"<p>Did you try doing the tutorials on your PC as shown in the text book for some concepts? I found them to be quite elaborate and helpful.</p>"},"replies":[]},{"id":"entry-2964850","entry":{"title":"conceptual catfish","time":"2021-07-13T19:52:40.000Z","msg":"<p>I would recommend reading the titles and the key words of the power point first, briefly scan each slide. Then go back and take notes. This way you will be familiar with the content, and you can make more connections the next time you go in. I also found it helpful to look up questions on google I had as I was reading through the slides. Don't try to understand every detail, just get the main ideas at first. I would recommend reading the textbook pages afterwards, after you get the gist of the section through the PowerPoints.</p>"},"replies":[]}]},{"id":"entry-2961217","entry":{"title":"breezy bird","time":"2021-07-12T06:08:25.000Z","msg":"<p>I would like to know how important comments are for a person writing a program for someone?&nbsp;</p>"},"replies":[{"id":"entry-2961563","entry":{"title":"advanced anaconda","time":"2021-07-12T06:56:16.000Z","msg":"<p>Good comments/documentation makes the code easier to maintain in the future. Importance depends on who it's for. If someone else can understand your code without comments, that's fine. However, if your code gets looked at by multiple people, there's a chance that some people will not understand it so&nbsp;it might be a good idea to add some context. Hope this helps.</p>"},"replies":[]},{"id":"entry-2966318","entry":{"title":"preliminary pelican","time":"2021-07-14T06:18:36.000Z","msg":"<p>Hi Henry,</p>\n<p>Comments are important for a person writing ANY program, whether for themselves or for others to read.&nbsp; If you write code without commenting your reasoning behind your steps, you may not remember your reasons behind the code if you revisit it 6 months later.&nbsp; Writing comments may seem cumbersome and extra work, but in the long run, the code will be more readable by yourself and others trying to understand the code and logic behind it.</p>"},"replies":[]}]},{"id":"entry-2961272","entry":{"title":"ugliest trout","time":"2021-07-12T06:15:02.000Z","msg":"<p><span style=\"font-size: 18pt;\">&nbsp;Standard Real Number Types</span></p>\n<p><span style=\"font-size: 12pt;\">It has shown three data types, which are short real, long real, and Extended-precision real. What is the exact mean of the significant numbers and the Approximate Range of it?</span></p>"},"replies":[]},{"id":"entry-2961663","entry":{"title":"hilarious harrier","time":"2021-07-12T07:19:49.000Z","msg":"<p>How does the program know what part of the variable you want to access</p>\n<p>eg.</p>\n<p>list BYTE 10,20,30,40</p>\n<p>ListSize = ($ - list) ;list here returns the offset</p>\n<p>&nbsp;</p>\n<p>firstval DWORD 11111111h</p>\n<p>move eax,firstval ; firstval here returns the value at the offset</p>"},"replies":[]}]}